#+OPTIONS: num:nil toc:nil reveal_history:t reveal_control:nil reveal_progress:t reveal_center:nil reveal_title_slide:nil
#+REVEAL_HLEVEL: 0
#+REVEAL_TRANS: fade
#+REVEAL_THEME: default
#+STARTUP: showeverything

To view the slides below in presentation mode, open [[file:README.html]] in a web browser.

* Use =mutate= to create new columns
#+BEGIN_SRC R :exports none :session :results none
  library(tidyverse)
  # turn off coloring of output that screws up org mode formatting
  # of tibbles
  options(crayon.enabled = FALSE, messages = F, warnings = F)
  library(rasilabRtemplates)

  data <- read_tsv("data/example_dataset_2.tsv")
#+END_SRC

#+BEGIN_SRC R :exports both :results output :session :eval no
  data <- read_tsv("data/example_dataset_2.tsv") %>%
      print()
#+END_SRC

#+RESULTS:
#+begin_example
# A tibble: 16 x 3
   strain  mean_yfp mean_rfp
   <chr>      <int>    <int>
 1 schp688     1748    20754
 2 schp684     3294    20585
 3 schp690     3535    20593
 4 schp687     4658    20860
 5 schp686     5000    21171
 6 schp685     7379    22956
 7 schp683     9365    23866
 8 schp689     8693    22649
 9 schp679     2528    19906
10 schp675     3687    20438
11 schp681     3705    20227
12 schp678     4378    20630
13 schp677     3967    20604
14 schp676     2657    20223
15 schp674     1270    20316
16 schp680     1117    19377
#+end_example

* Use =TYPE_join= to join two data frames

#+BEGIN_SRC R :exports none :results output :session
  annotations <- read_tsv("data/example_dataset_3.tsv") %>%
    print()
#+END_SRC

#+BEGIN_SRC R :exports both :results output :session :eval no
  annotations <- read_tsv("data/example_dataset_3.tsv") %>%
    print()
#+END_SRC

#+RESULTS:
#+begin_example
# A tibble: 17 x 3
   strain  insert_sequence kozak_region
   <chr>   <chr>           <chr>       
 1 schp674 10×AAG          G           
 2 schp675 10×AAG          B           
 3 schp676 10×AAG          F           
 4 schp677 10×AAG          E           
 5 schp678 10×AAG          D           
 6 schp679 10×AAG          A           
 7 schp680 10×AAG          H           
 8 schp681 10×AAG          C           
 9 schp683 10×AGA          G           
10 schp684 10×AGA          B           
11 schp685 10×AGA          F           
12 schp686 10×AGA          E           
13 schp687 10×AGA          D           
14 schp688 10×AGA          A           
15 schp689 10×AGA          H           
16 schp690 10×AGA          C           
17 control <NA>            <NA>
#+end_example

* =inner_join= keeps common rows

#+BEGIN_SRC R :exports both :results output :session
  data %>%
    inner_join(annotations, by = "strain") %>% 
    print()
#+END_SRC

#+RESULTS:
#+begin_example
# A tibble: 16 x 6
   strain  mean_yfp mean_rfp mean_ratio insert_sequence kozak_region
   <chr>      <int>    <int>      <dbl> <chr>           <chr>       
 1 schp688     1748    20754     0.0842 10×AGA          A           
 2 schp684     3294    20585     0.160  10×AGA          B           
 3 schp690     3535    20593     0.172  10×AGA          C           
 4 schp687     4658    20860     0.223  10×AGA          D           
 5 schp686     5000    21171     0.236  10×AGA          E           
 6 schp685     7379    22956     0.321  10×AGA          F           
 7 schp683     9365    23866     0.392  10×AGA          G           
 8 schp689     8693    22649     0.384  10×AGA          H           
 9 schp679     2528    19906     0.127  10×AAG          A           
10 schp675     3687    20438     0.180  10×AAG          B           
11 schp681     3705    20227     0.183  10×AAG          C           
12 schp678     4378    20630     0.212  10×AAG          D           
13 schp677     3967    20604     0.193  10×AAG          E           
14 schp676     2657    20223     0.131  10×AAG          F           
15 schp674     1270    20316     0.0625 10×AAG          G           
16 schp680     1117    19377     0.0576 10×AAG          H
#+end_example

#+BEGIN_NOTES
- Joining data with annotations is a very common workflow and part of tidy data analysis that we will be talking about later.
- Joining data with annotations is useful for slicing and dicing data by different experimental variables and is a common way to see dependence on different variables.
#+END_NOTES

* =left_join= keeps all rows in left data frame

#+BEGIN_SRC R :exports both :results output :session
  data %>%
    left_join(annotations, by = "strain") %>% 
    print()
#+END_SRC

#+RESULTS:
#+begin_example
# A tibble: 16 x 6
   strain  mean_yfp mean_rfp mean_ratio insert_sequence kozak_region
   <chr>      <int>    <int>      <dbl> <chr>           <chr>       
 1 schp688     1748    20754     0.0842 10×AGA          A           
 2 schp684     3294    20585     0.160  10×AGA          B           
 3 schp690     3535    20593     0.172  10×AGA          C           
 4 schp687     4658    20860     0.223  10×AGA          D           
 5 schp686     5000    21171     0.236  10×AGA          E           
 6 schp685     7379    22956     0.321  10×AGA          F           
 7 schp683     9365    23866     0.392  10×AGA          G           
 8 schp689     8693    22649     0.384  10×AGA          H           
 9 schp679     2528    19906     0.127  10×AAG          A           
10 schp675     3687    20438     0.180  10×AAG          B           
11 schp681     3705    20227     0.183  10×AAG          C           
12 schp678     4378    20630     0.212  10×AAG          D           
13 schp677     3967    20604     0.193  10×AAG          E           
14 schp676     2657    20223     0.131  10×AAG          F           
15 schp674     1270    20316     0.0625 10×AAG          G           
16 schp680     1117    19377     0.0576 10×AAG          H
#+end_example

* Use =group_by= to group subsets of rows

#+BEGIN_SRC R :exports none :results none :session
  data <- read_tsv("data/example_dataset_4.tsv") %>% 
    arrange(desc(strain)) %>%
    print(n = 10)
#+END_SRC

#+BEGIN_SRC R :exports both :results output :session :eval no
  data <- read_tsv("data/example_dataset_4.tsv") %>% 
    print(n = 10)
#+END_SRC

#+RESULTS:
#+begin_example
# A tibble: 74 x 4
   strain    yfp   rfp replicate
   <chr>   <int> <int>     <int>
 1 schp690  3640 20944         1
 2 schp690  3502 20881         2
 3 schp690  3569 20063         3
 4 schp690  3475 20773         4
 5 schp690  3487 20307         5
 6 schp689  9790 24399         1
 7 schp689  9821 24932         2
 8 schp689  9310 23007         3
 9 schp689  6269 19075         4
10 schp689  8273 21835         5
# ... with 64 more rows
#+end_example

